Revit 2027 API
EnergyDataSettings.CheckRangeOfSkylightWidth Method
Note: This API is now obsolete.
 Checks that the skylight width is greater than or equal to eight inches.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool CheckRangeOfSkylightWidth(
	double skylightWidth
)
<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function CheckRangeOfSkylightWidth (
	skylightWidth As Double
) As Boolean
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool CheckRangeOfSkylightWidth(
	double skylightWidth
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member CheckRangeOfSkylightWidth :
        skylightWidth : float -> bool
Parameters
skylightWidth Double
 The skylight width to be checked. Should be greater than or equal to eight inches.
Return Value
Boolean
 True if the skylight width is greater than or equal to eight inches, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace